[
  {
    "id": 1,
    "name": "Tour Management System ",
    "image": "https://i.ibb.co/2YdBjYCS/tour-management-system-pic.png",
    "brief": "The Tourist Guide site is an internet space for travelers. The site offers all kinds of information to travelers heading to attractions in World, so they prepare for their trip. The Tourist Guide site provides a rich description of many tourist attractions, so visitors know what to expect. The site showcases the local culture and food and highlights activities so that the visitor has a complete travel experience. The Tourist Guide site has everything you need to enjoy your trip to the world, from famous landmarks to less popular attractions.",
    "techStack": ["React", "Javascript", "Firebase", "Tailwind CSS", "HTML5","MongoDB","Expressjs","Nodejs"],
    "liveLink": "https://tourism-management-syste-465b0.web.app/",
    "githubLink": "https://github.com/foysalhaque1/tour-management-system",
    "challenges": [
      "Slow loading times for high-resolution images .",
      "Balancing rich UI animations with smooth performance was tricky",
      "Balancing image quality with load times for attraction galleries"
    ],
    "improvements": [
      "Utilize machine learning technology to generate personalized itineraries for users based on their preferences and previous behavior.",
      "Include eco-stays, carbon-neutral travel, and responsible tourism practices.",
      "Develop mobile app version"
    ]
  },
  {
    "id": 2,
    "name": "Job Assessment System",
    "image": "https://i.ibb.co/ymjTZdb4/job-assessment-system.png",
    "brief": "This online group-study platform successfully addresses collaborative learning issues through a real-time interface and experience available online with React.js, where students can create, submit and grade assignments in real time. Its interactive features, such as live editing and feedback tools, need complete JavaScript interactivity. The backend logic that takes care of individual assignment workflows, security, and permision levels is built with Node.js and Express.js.  ",
    "description": "",
    "techStack": ["React", "Javascript", "Firebase", "Tailwind CSS", "HTML5","MongoDB","Expressjs","Nodejs"],
    "liveLink": "https://job-assessment-client-side.web.app/",
    "githubLink": "https://github.com/foysalhaque1/job-assessment-system-client-side",
    "challenges": [
      "Complex role management between assignment creators, submitters and graders",
      "Slow loading with rich-text assignment submissions"
    ],
    "improvements": [
      "AI-assisted grading suggestions for consistency",
      "Implement AI-powered automatic pattern arrangement",
      "Offline assignment drafting"
    ]
  },
  {
    "id": 3,
    "name": "A-Gardening-Community-Resource-Hub",
    "image": "https://i.ibb.co/p6ByjL7W/garden-project.png",
    "brief": "This gardening platform addresses the problem of gardening information being scattered here and there, allowing a place to share expertise and collaborate to solve problems together in one location. It helps to unite the solitary gardener with community features and replaces unreliable online answers with solutions verified by the community. It provides urban gardening information by utilizing space-based growing guides and allows you to show your plant issues with real-time photo uploads. ",
    "description": "StitchTrack uses computer vision to monitor production lines in real-time, identifying defects and efficiency bottlenecks. The system reduces quality control time by 40% and provides detailed analytics for continuous improvement.",
    "techStack": ["React", "Javascript", "Firebase", "Tailwind CSS", "HTML5","MongoDB","Expressjs","Nodejs"],
    "liveLink": "https://assignment-10-client-sid-c244c.web.app/",
    "githubLink": "https://github.com/foysalhaque1/A-Gardening-Community--Resource-Hub-client-side",
    "challenges": [
      "Handling image loading problem",
      "Sometimes faced the server related issue"
      
    ],
    "improvements": [
      "AI-powered plant doctor using image recognition for instant disease diagnosis",
      "Expanded learning paths with video tutorials from master gardeners"
     
    ]
  }
]